LePetitBis.Field = DS.Model.extend

  key: DS.attr 'string'
  type: DS.attr 'string', defaultValue: 'bool'
  restaurant: DS.belongsTo 'restaurant'

  isBoolean: Ember.computed.equal('type','bool')

LePetitBis.Field.FIXTURES = [
   {
      "id":1,
      "key":"חסה"
   },
   {
      "id":2,
      "key":"עלי בייבי"
   },
   {
      "id":3,
      "key":"נבטים סיניים"
   },
   {
      "id":4,
      "key":"כרוב אדום"
   },
   {
      "id":5,
      "key":"כרוב לבן"
   },
   {
      "id":6,
      "key":"פסטה"
   },
   {
      "id":7,
      "key":"עגבניות שרי"
   },
   {
      "id":8,
      "key":"עגבניה"
   },
   {
      "id":9,
      "key":"מלפפון"
   },
   {
      "id":10,
      "key":"גזר"
   },
   {
      "id":11,
      "key":"גמבה בצבעים"
   },
   {
      "id":12,
      "key":"פטריות"
   },
   {
      "id":13,
      "key":"מלפפון חמוץ"
   },
   {
      "id":14,
      "key":"זיתים שחורים"
   },
   {
      "id":15,
      "key":"זיתים ירוקים"
   },
   {
      "id":16,
      "key":"גרעיני תירס"
   },
   {
      "id":17,
      "key":"תירס גמדי"
   },
   {
      "id":18,
      "key":"אננס"
   },
   {
      "id":19,
      "key":"קולורבי"
   },
   {
      "id":20,
      "key":"צנון"
   },
   {
      "id":21,
      "key":"בצל סגול"
   },
   {
      "id":22,
      "key":"בצל לבן"
   },
   {
      "id":23,
      "key":"בצל ירוק"
   },
   {
      "id":24,
      "key":"פטרוזיליה"
   },
   {
      "id":25,
      "key":"בזיליקום"
   },
   {
      "id":26,
      "key":"נענע"
   },
   {
      "id":27,
      "key":"פלח לימון"
   },
   {
      "id":28,
      "key":"גרעיני חמנייה"
   },
   {
      "id":29,
      "key":"קרוטונים"
   },
   {
      "id":30,
      "key":"שומשום"
   },
   {
      "id":31,
      "key":"זעתר"
   },
   {
      "id":32,
      "key":"אורגנו"
   },
   {
      "id":33,
      "key":"אגוזי מלך"
   },
   {
      "id":34,
      "key":"צימוקים"
   },
   {
      "id":35,
      "key":"צנובר"
   },
   {
      "id":36,
      "key":"סלק אדום"
   },
   {
      "id":37,
      "key":"בורגול"
   },
   {
      "id":38,
      "key":"גרגירי חומוס"
   },
   {
      "id":39,
      "key":"עדשים שחורות"
   },
   {
      "id":40,
      "key":"כוסברה"
   },
   {
      "id":41,
      "key":"קינואה"
   },
   {
      "id":42,
      "key":"אבוקדו (₪4.00)"
   },
   {
      "id":43,
      "key":"גבינת שמנת 5% (₪4.00)"
   },
   {
      "id":44,
      "key":"ביצה קשה (₪4.00)"
   },
   {
      "id":45,
      "key":"סלט טונה (₪4.00)"
   },
   {
      "id":46,
      "key":"גבינה בולגרית 5% (₪4.00)"
   },
   {
      "id":47,
      "key":"גבינת פטה (₪4.00)"
   },
   {
      "id":48,
      "key":"גבינה צהובה (₪4.00)"
   },
   {
      "id":49,
      "key":"גבינת צפתית 5% (₪4.00)"
   },
   {
      "id":50,
      "key":"לקט אנטיפסטי (₪4.00)"
   },
   {
      "id":51,
      "key":"טונה (₪4.00)"
   },
   {
      "id":52,
      "key":"סלט ביצים (₪4.00)"
   },
   {
      "id":53,
      "key":"עלי גפן ממולאים (₪4.00)"
   },
   {
      "id":54,
      "key":"גבינת שמנת שום שמיר5% (₪4.00)"
   },
   {
      "id":55,
      "key":"גבינת שמנת זיתים 5% (₪4.00)"
   },
   {
      "id":56,
      "key":"חביתת ירק (₪6.00)"
   },
   {
      "id":57,
      "key":"עין הפוכה (₪6.00)"
   },
   {
      "id":58,
      "key":"ביצת עין (₪6.00)"
   },
   {
      "id":59,
      "key":"ביצה מקושקשת (₪6.00)"
   },
   {
      "id":60,
      "key":"סלמון מעושן (₪10.00)"
   }
]
# ת
#  הירקות לסלט:
#  חסה   עלי בייבי   נבטים סיניים   כרוב אדום   כרוב לבן   פסטה   עגבניות שרי   עגבניה   מלפפון   גזר   גמבה בצבעים   פטריות   מלפפון חמוץ   זיתים שחורים   זיתים ירוקים   גרעיני תירס   תירס גמדי   אננס   קולורבי   צנון   בצל סגול   בצל לבן   בצל ירוק   פטרוזיליה   בזיליקום   נענע   פלח לימון   גרעיני חמנייה   קרוטונים   שומשום   זעתר   אורגנו   אגוזי מלך   צימוקים   צנובר   סלק אדום   בורגול   גרגירי חומוס    עדשים שחורות   כוסברה   קינואה
# בחר/י שני רטבים לסלט:
#  חרדל   צ`ילי חריף   רוטב אלף האיים לייט    רוטב תאילנדי   קטשופ   טחינה   רוטב פיצה   בלסמי ושמן זית   רוטב ויניגרט לייט   פסטו   מיונז   מיץ לימון   שום שמיר לייט   חומוס   שמן זית    צ`ילי מתוק   חלפיניו לייט   איולי לייט   רוטב נפאל   רוטב חרדל דבש   ויניגרט עשבי תיבול
# בחר/י תוספות בתשלום:
#  אבוקדו (₪4.00)  גבינת שמנת 5% (₪4.00)  ביצה קשה (₪4.00)  סלט טונה (₪4.00)  גבינה בולגרית 5% (₪4.00)  גבינת פטה (₪4.00)  גבינה צהובה (₪4.00)  גבינת צפתית 5% (₪4.00)  לקט אנטיפסטי (₪4.00)  טונה (₪4.00)  סלט ביצים (₪4.00)  עלי גפן ממולאים (₪4.00)  גבינת שמנת שום שמיר5%  (₪4.00)  גבינת שמנת זיתים 5% (₪4.00)  חביתת ירק (₪6.00)  עין הפוכה (₪6.00)  ביצת עין (₪6.00)  ביצה מקושקשת (₪6.00)  סלמון מעושן (₪10.00)
